In [82]:
# import pandas package
import pandas as pd

# B2.1

In [83]:
# contents of comma_input.txt
!cat comma_input.txt

subhendu, 21, M
Emma, 29, F
James, 35, M

In [84]:
# Reading comma seperated input file to dataframe
pd.read_table("comma_input.txt",delimiter=",")

  subhendu   21   M
0     Emma   29   F
1    James   35   M

In [85]:
# Reading comma seperated input file to dataframe with default header
pd.read_table("comma_input.txt",delimiter=",", header=None)

          0   1   2
0  subhendu  21   M
1      Emma  29   F
2     James  35   M

In [87]:
# Reading comma seperated input file to dataframe with custom header names
pd.read_table("comma_input.txt", delimiter=",", names=["name","age","gender"])

       name  age gender
0  subhendu   21      M
1      Emma   29      F
2     James   35      M

In [93]:
# contents of space_input.txt
!cat space_input.txt

Subhendu maji Finance 45000
Henry smith IT 21000
Erica jones Marketing 12750
Andrew Madrid IT 30500

In [94]:
# Reading space seperated input file to dataframe
pd.read_table("space_input.txt",delimiter=" ")

  Subhendu    maji    Finance  45000
0    Henry   smith         IT  21000
1    Erica   jones  Marketing  12750
2   Andrew  Madrid         IT  30500

In [95]:
# Reading space seperated input file to dataframe with default header
pd.read_table("space_input.txt", delimiter=" ",header=None)

          0       1          2      3
0  Subhendu    maji    Finance  45000
1     Henry   smith         IT  21000
2     Erica   jones  Marketing  12750
3    Andrew  Madrid         IT  30500

In [96]:
# Reading space seperated input file to dataframe with custom header names
pd.read_table("space_input.txt", delimiter=" ", names=["first_name","last_name","department","salary"])

  first_name last_name department  salary
0   Subhendu      maji    Finance   45000
1      Henry     smith         IT   21000
2      Erica     jones  Marketing   12750
3     Andrew    Madrid         IT   30500

# B2.2

In [97]:
# importing sqlite3
import sqlite3

In [40]:
# create table student2121 in database
query = """
        CREATE TABLE student2121
        (course VARCHAR(20), courseid VARCHAR(20),
        MarkObtained REAL, MarkExpected INTEGER);
        """
con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [41]:
# create entries in table
data = [('Data Science Foundation', '20CSE421A', 48, 50),
        ('Computer Vision', '18ETCS002121', 45, 50),
        ('Computational Intelligence', '18ETCS002121', 38, 50)]

stmt = "INSERT INTO student2121 VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [42]:
# get all the rows from table
cursor = con.execute('select * from student2121')
rows = cursor.fetchall()

import pandas as pd
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

                       course      courseid  MarkObtained  MarkExpected
0     Data Science Foundation  18ETCS002121          48.0            50
1             Computer Vision  18ETCS002121          45.0            50
2  Computational Intelligence  18ETCS002121          38.0            50